Revit 2024 API
PlasticVinyl.PlasticvinylType Property
 The property labeled "Type" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string PlasticvinylType { get; }
Visual Basic
Public Shared ReadOnly Property PlasticvinylType As String
	Get
Visual C++
public:
static property String^ PlasticvinylType {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylType".
See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace